export const busRoutes = [
    {
      id: 1,
      name: 'Lefkoşa 1',
      stops: [
        { id: 1, name: 'Bus stop 1', lat: 35.2297, lon: 33.3245 },
        { id: 2, name: 'Bus stop 2', lat: 35.2259, lon: 33.3257 },
        { id: 3, name: 'Bus stop 3', lat: 35.2106, lon: 33.3436 },
        { id: 4, name: 'Bus stop 4', lat: 35.2110, lon: 33.3707 },
        { id: 5, name: 'Bus stop 5', lat: 35.2113, lon: 33.3758 },
        { id: 6, name: 'Bus stop 6', lat: 35.2093, lon: 33.3667 },
        { id: 7, name: 'Bus stop 7', lat: 35.2021, lon: 33.3674 },
        { id: 8, name: 'Bus stop 8', lat: 35.1990, lon: 33.3678 },
        { id: 9, name: 'Bus stop 9', lat: 35.1948, lon: 33.3678 },
        { id: 10, name: 'Bus stop 10', lat: 35.1880, lon: 33.3661 },
        { id: 11, name: 'Bus stop 11', lat: 35.2263, lon: 33.3261 },
        { id: 12, name: 'Bus stop 12', lat: 35.2297, lon: 33.3246 },
      ],
      waypoints: [
        [35.2297, 33.3245],
        [35.2289, 33.3231],//35.22892903191884, 33.32310749497793
        [35.2259, 33.3257],
        [35.2106, 33.3436],
        [35.2110, 33.3707],
        [35.2113, 33.3758],
        [35.2094, 33.3667],
        [35.2021, 33.3674],
        [35.1990, 33.3678],
        [35.1948, 33.3678],
        [35.1880, 33.3661],
        [35.1854, 33.3590],//
        [35.1848, 33.3641],//
        [35.1850, 33.3646],// 
        [35.2093, 33.3664],//
        [35.2263, 33.3261],
        [35.2297, 33.3246],
      ],
      style: {
        color: '#de1115', // red
        weight: 5,
        opacity: 0.8
      }
    },
    {
      id: 2,
      name: 'Lefkoşa 2',
      stops: [
        { id: 1, name: 'Bus stop 1', lat: 35.2297, lon: 33.3245 },
        { id: 2, name: 'Bus stop 2', lat: 35.2259, lon: 33.3257 },
        { id: 3, name: 'Bus stop 3', lat: 35.1867, lon: 33.3655 },
        { id: 4, name: 'Bus stop 4', lat: 35.1823, lon: 33.3624 },
        { id: 5, name: 'Bus stop 5', lat: 35.1859, lon: 33.3573 },
        { id: 6, name: 'Bus stop 6', lat: 35.1907, lon: 33.3519 },
        { id: 7, name: 'Bus stop 7', lat: 35.1941, lon: 33.3482 },
        { id: 8, name: 'Bus stop 8', lat: 35.1998, lon: 33.3407 },
        { id: 9, name: 'Bus stop 9', lat: 35.2051, lon: 33.3302 },
        { id: 10, name: 'Bus stop 10', lat: 35.2263, lon: 33.3261 },
        { id: 11, name: 'Bus stop 11', lat: 35.2297, lon: 33.3246 },
      ],
      waypoints: [
        [35.2297, 33.3245],
        [35.2289, 33.3231],//35.22892903191884, 33.32310749497793
        [35.2259, 33.3257],
        [35.2082, 33.3669],//
        [35.1823, 33.3624],
        [35.1859, 33.3573],
        [35.1907, 33.3519],
        [35.1941, 33.3482],
        [35.1998, 33.3407],
        [35.2051, 33.3302],
        [35.2092, 33.3231],//
        [35.2263, 33.3261],
        [35.2297, 33.3246],
      ],
      style: {
        color: '#0e9305', // green
        weight: 5,
        opacity: 0.8
      }
    },
    {
      id: 3,
      name: 'Kızılbaş',
      stops: [
        { id: 1, name: 'Bus stop 1', lat: 35.2297, lon: 33.3245 },
        { id: 2, name: 'Bus stop 2', lat: 35.2259, lon: 33.3257 },
        { id: 3, name: 'Bus stop 3', lat: 35.2031, lon: 33.3513 },
        { id: 4, name: 'Bus stop 4', lat: 35.1993, lon: 33.3568 },
        { id: 5, name: 'Bus stop 5', lat: 35.2025, lon: 33.3639 },
        { id: 6, name: 'Bus stop 6', lat: 35.2034, lon: 33.3688 },
        { id: 7, name: 'Bus stop 7', lat: 35.2032, lon: 33.3732 },
        { id: 8, name: 'Bus stop 8', lat: 35.2030, lon: 33.3768 },
        { id: 9, name: 'Bus stop 9', lat: 35.2087, lon: 33.3787 },
        { id: 10, name: 'Bus stop 10', lat: 35.2157, lon: 33.3782 },
        { id: 11, name: 'Bus stop 11', lat: 35.2202, lon: 33.3774 },
        { id: 12, name: 'Bus stop 12', lat: 35.2263, lon: 33.3261 },
        { id: 13, name: 'Bus stop 13', lat: 35.2297, lon: 33.3246 },
      ],
      waypoints: [
      [35.2297, 33.3245],
      [35.2289, 33.3231],//35.22892903191884, 33.32310749497793
      [35.2259, 33.3257],
      [35.2031, 33.3513],
      [35.1993, 33.3568],
      [35.2025, 33.3639],
      [35.2034, 33.3688],
      [35.2032, 33.3732],
      [35.2030, 33.3768],
      [35.2087, 33.3787],
      [35.2157, 33.3782],
      [35.2202, 33.3774],
      [35.2263, 33.3261],
      [35.2297, 33.3246],
      ],
      style: {
        color: '#838384', // grey
        weight: 5,
        opacity: 0.8
      }
    },
    {
      id: 4,
      name: 'Gönyeli 1',
      stops: [
        { id: 1, name: 'Bus stop 1', lat: 35.2297, lon: 33.3245 },
        { id: 2, name: 'Bus stop 2', lat: 35.2259, lon: 33.3257 },
        { id: 3, name: 'Bus stop 3', lat: 35.2094, lon: 33.2983 },
        { id: 4, name: 'Bus stop 4', lat: 35.2087, lon: 33.3074 },
        { id: 5, name: 'Bus stop 5', lat: 35.2118, lon: 33.3072 },
        { id: 6, name: 'Bus stop 6', lat: 35.2147, lon: 33.3080 },
        { id: 7, name: 'Bus stop 7', lat: 35.2124, lon: 33.3108 },
        { id: 8, name: 'Bus stop 8', lat: 35.2103, lon: 33.3147 },
        { id: 9, name: 'Bus stop 9', lat: 35.2093, lon: 33.3184 },
        { id: 10, name: 'Bus stop 10', lat: 35.2127, lon: 33.3342 },
        { id: 11, name: 'Bus stop 11', lat: 35.2263, lon: 33.3261 },
        { id: 12, name: 'Bus stop 12', lat: 35.2297, lon: 33.3246 },
      ],
      waypoints: [
      [35.2297, 33.3245],
      [35.2289, 33.3231],//35.22892903191884, 33.32310749497793
      [35.2259, 33.3257],
      [35.2298, 33.3124],//
      [35.2094, 33.2983],
      [35.2087, 33.3074],
      [35.2118, 33.3072],
      [35.2147, 33.3080],
      [35.2124, 33.3108],
      [35.2103, 33.3147],
      [35.2093, 33.3184],
      [35.2127, 33.3342],
      [35.2263, 33.3261],
      [35.2297, 33.3246],
      ],
      style: {
        color: '#8a3d94', // purple
        weight: 5,
        opacity: 0.8
      }
    },
    {
      id: 5,
      name: 'Gönyeli 2',
      stops: [
        { id: 1, name: 'Bus stop 1', lat: 35.2297, lon: 33.3245 },
        { id: 2, name: 'Bus stop 2', lat: 35.2259, lon: 33.3257 },
        { id: 3, name: 'Bus stop 3', lat: 35.2100, lon: 33.3149 },
        { id: 4, name: 'Bus stop 4', lat: 35.2123, lon: 33.3108 },
        { id: 5, name: 'Bus stop 5', lat: 35.2182, lon: 33.3034 },
        { id: 6, name: 'Bus stop 6', lat: 35.2217, lon: 33.3009 },
        { id: 7, name: 'Bus stop 7', lat: 35.2256, lon: 33.2984 },
        { id: 8, name: 'Bus stop 8', lat: 35.2263, lon: 33.3261 },
        { id: 9, name: 'Bus stop 9', lat: 35.2297, lon: 33.3246 },
      ],
      waypoints: [
      [35.2297, 33.3245],
      [35.2289, 33.3231],//35.22892903191884, 33.32310749497793
      [35.2259, 33.3257],
      [35.2298, 33.3124],//
      [35.2100, 33.3149],
      [35.2123, 33.3108],
      [35.2182, 33.3034],
      [35.2217, 33.3009],
      [35.2256, 33.2984],
      [35.2263, 33.3261],
      [35.2297, 33.3246],
      ],
      style: {
        color: '#121e1e', // 
        weight: 5,
        opacity: 0.8
      }
    },
    {
      id: 6,
      name: 'Gönyeli / Metehan',
      stops: [
        { id: 1, name: 'Bus stop 1', lat: 35.2297, lon: 33.3245 },
        { id: 2, name: 'Bus stop 2', lat: 35.2259, lon: 33.3257 },
        { id: 3, name: 'Bus stop 3', lat: 35.2086, lon: 33.3185 },
        { id: 4, name: 'Bus stop 4', lat: 35.2080, lon: 33.3135 },
        { id: 5, name: 'Bus stop 5', lat: 35.2083, lon: 33.3074 },
        { id: 6, name: 'Bus stop 6', lat: 35.2101, lon: 33.2934 },
        { id: 7, name: 'Bus stop 7', lat: 35.1981, lon: 33.3117 },
        { id: 8, name: 'Bus stop 8', lat: 35.1938, lon: 33.3211 },
        { id: 9, name: 'Bus stop 9', lat: 35.1914, lon: 33.3256 },
        { id: 10, name: 'Bus stop 10', lat: 35.2018, lon: 33.3223 },
        { id: 11, name: 'Bus stop 11', lat: 35.2050, lon: 33.3173 },
        { id: 12, name: 'Bus stop 12', lat: 35.2088, lon: 33.3182 },
        { id: 13, name: 'Bus stop 13', lat: 35.2263, lon: 33.3261 },
        { id: 14, name: 'Bus stop 14', lat: 35.2297, lon: 33.3246 },
      ],
      waypoints: [
      [35.2297, 33.3243],
      [35.2289, 33.3231],//35.22892903191884, 33.32310749497793
      [35.2259, 33.3257],
      [35.2298, 33.3124],//
      [35.2086, 33.3185],//35.208651601674795, 33.31859629350522
      [35.2080, 33.3135],//35.208022548764546, 33.31353563919127
      [35.2083, 33.3074],//35.20831595064752, 33.307416160022214
      [35.2101, 33.2934],
      [35.1981, 33.3117],
      [35.1938, 33.3211],
      [35.1914, 33.3256],
      [35.2018, 33.3223],
      [35.2050, 33.3173],//35.20500875551119, 33.31735112032624
      [35.2088, 33.3182],//35.208824827194114, 33.318239930215945
      [35.2263, 33.3261],
      [35.2297, 33.3246],
      ],
      style: {
        color: '#2e21f3', // 
        weight: 5,
        opacity: 0.8
      }
    },
    {
      id: 7,
      name: 'Ortaköy / Yenikent',
      stops: [
        { id: 1, name: 'Bus stop 1', lat: 35.2297, lon: 33.3245 },
        { id: 2, name: 'Bus stop 2', lat: 35.2259, lon: 33.3257 },
        { id: 3, name: 'Bus stop 3', lat: 35.2077, lon: 33.3399 },
        { id: 4, name: 'Bus stop 4', lat: 35.2009, lon: 33.3412 },
        { id: 5, name: 'Bus stop 5', lat: 35.1986, lon: 33.3338 },
        { id: 6, name: 'Bus stop 6', lat: 35.1969, lon: 33.3311 },
        { id: 7, name: 'Bus stop 7', lat: 35.1991, lon: 33.3272 },
        { id: 8, name: 'Bus stop 8', lat: 35.2011, lon: 33.3236 },
        { id: 9, name: 'Bus stop 9', lat: 35.2263, lon: 33.3261 },
        { id: 10, name: 'Bus stop 10', lat: 35.2297, lon: 33.3246 }
      ],
      waypoints: [
        [35.2297, 33.3244],
        [35.2289, 33.3231],//35.22892903191884, 33.32310749497793
        [35.2259, 33.3257],
        [35.2077, 33.3399],
        [35.2009, 33.3412],
        [35.1986, 33.3338],
        [35.1969, 33.3311],
        [35.1991, 33.3272],
        [35.2011, 33.3236],//35.2011182621005, 33.32363839186351
        [35.2263, 33.3261],
        [35.2297, 33.3246]
      ],
      style: {
        color: '#8d6a5e', // 
        weight: 5,
        opacity: 0.8
      }
    },
    {
      id: 8,
      name: 'Campus - Kyrenia',
      stops: [
        { id: 1, name: 'Bus stop 1', lat: 35.3326, lon: 33.3144 },
        { id: 2, name: 'Bus stop 2', lat: 35.3304, lon: 33.3257 },
        { id: 3, name: 'Bus stop 3', lat: 35.3338, lon: 33.3325 },
        { id: 4, name: 'Bus stop 4', lat: 35.3342, lon: 33.3404 },
        { id: 5, name: 'Bus stop 5', lat: 35.3338, lon: 33.3316 },
        { id: 6, name: 'Bus stop 6', lat: 35.3300, lon: 33.3274 },//6
        { id: 7, name: 'Bus stop 7', lat: 35.2858, lon: 33.2796 },
        { id: 8, name: 'Bus stop 8', lat: 35.2297, lon: 33.3246 },
      ],
      waypoints: [
        [35.3326, 33.3144],
        [35.3304, 33.3257],
        [35.3338, 33.3325],
        [35.3342, 33.3404],
        [35.3338, 33.3316],
        [35.3300, 33.3274], //6
        [35.2858, 33.2796],      
        [35.2137, 33.3209],//
        [35.2297, 33.3246],
      ],
      style: {
        color: '#c65d85', // pink
        weight: 5,
        opacity: 0.8
      }
    },
    {
      id: 9,
      name: 'Campus - Güzelyurt',
      stops: [
        { id: 1, name: 'Bus stop 1', lat: 35.1929, lon: 32.9947 },
        { id: 2, name: 'Bus stop 2', lat: 35.2297, lon: 33.3246 },
      ],
      waypoints: [
        [35.1929, 32.9947],
        [35.2297, 33.3246],
      ],
      style: {
        color: '#2596be', // sky
        weight: 5,
        opacity: 0.8
      }
    },
    {
      id: 10,
      name: 'Campus - Famagusta',
      stops: [
        { id: 1, name: 'Bus stop 1', lat: 35.1204, lon: 33.9376 },
        { id: 2, name: 'Bus stop 2', lat: 35.2297, lon: 33.3246 },
      ],
      waypoints: [
        [35.1204, 33.9376],
        [35.2297, 33.3246],
      ],
      style: {
        color: '#c1632f', // orange
        weight: 5,
        opacity: 0.8
      }
    }
  ];